Revit 2026 API

# BuiltInFailuresGridFailures Class

---

Failures about Grid.

SystemObject Autodesk.Revit.DBBuiltInFailuresGridFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class GridFailures
```
```vb
Public NotInheritable Class GridFailures
```
```cpp
public ref class GridFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type GridFailures = class end
```

The BuiltInFailuresGridFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GridEndSegmentsLengthTooShort | The end segment length for a grid must be at least [Length Value] |
|  | GridInGridChainCannotMirror | A grid that is a sub-grid of a multi-segment grid can only be mirrored if the entire multi-segment grid is being mirrored. |
|  | GridlineAxisTooClose | Axis of gridlines should not change order or be closer than [Value] to each other. |
|  | GridlineAxisTooFar | Axis of gridlines should not be further than [Value] to each other. |

#### Reference

Autodesk.Revit.DB Namespace